In [1]:
import pandas as pd

In [2]:
import numpy as np
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv("xAPI-Edu-Data.csv")
df.head()

,gender,NationalITy,PlaceofBirth,StageID,GradeID,SectionID,Topic,Semester,Relation,cns,dsa,oops,os
0,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,16.0,2,20
1,M,KW,NaN,lowerlevel,G-04,A,NaN,F,Father,20.0,20.0,3,25
2,M,KW,KuwaIT,NaN,G-04,A,IT,F,Father,10.0,7.0,0,30
3,M,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,NaN,25.0,5,35
4,NaN,KW,KuwaIT,lowerlevel,G-04,A,IT,F,Father,40.0,50.0,12,50

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   gender        22 non-null     object
 1   NationalITy   27 non-null     object
 2   PlaceofBirth  23 non-null     object
 3   StageID       26 non-null     object
 4   GradeID       27 non-null     object
 5   SectionID     28 non-null     object
 6   Topic         24 non-null     object
 7   Semester      28 non-null     object
 8   Relation      26 non-null     object
 9   cns           21 non-null     float64
 10  dsa           27 non-null     float64
 11  oops          28 non-null     int64
 12  os            28 non-null     int64
dtypes: float64(2), int64(2), object(9)
memory usage: 1.9+ KB

In [6]:
df.shape

(28, 13)

In [7]:
df.max()

C:\Users\parsh\AppData\Local\Temp\ipykernel_14940\1151452817.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.max()

SectionID       B
Semester        F
cns          70.0
dsa          88.0
oops           44
os             99
dtype: object

In [ ]:
df